tutorials/rigidBodyAndBeam_short/0/beam/Lambda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volTensorField;
    location    "2";
    object      Lambda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<tensor> 
60
(
(1 2.48098e-19 4.28152e-05 -6.20318e-21 1 -5.65935e-15 -4.28152e-05 5.65935e-15 1)
(1 3.02501e-19 4.05244e-05 -7.35375e-20 1 -5.65935e-15 -4.05244e-05 5.65935e-15 1)
(1 3.09718e-19 3.96044e-05 -8.6019e-20 1 -5.65935e-15 -3.96044e-05 5.65935e-15 1)
(1 3.27776e-19 3.78641e-05 -1.13875e-19 1 -5.65935e-15 -3.78641e-05 5.65935e-15 1)
(1 3.22674e-19 3.66148e-05 -1.15851e-19 1 -5.65935e-15 -3.66148e-05 5.65935e-15 1)
(1 3.18944e-19 3.50716e-05 -1.20864e-19 1 -5.65935e-15 -3.50716e-05 5.65935e-15 1)
(1 3.0533e-19 3.37042e-05 -1.14975e-19 1 -5.65935e-15 -3.37042e-05 5.65935e-15 1)
(1 2.93794e-19 3.22317e-05 -1.11849e-19 1 -5.65935e-15 -3.22317e-05 5.65935e-15 1)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (1 2.48098e-19 4.28152e-05 -6.20318e-21 1 -5.65935e-15 -4.28152e-05 5.65935e-15 1);
    }
    right
    {
        type            calculated;
        value           uniform (1 -2.47882e-19 -4.28152e-05 5.66457e-21 1 -5.65935e-15 4.28152e-05 5.65935e-15 1);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
